{
  "intro": {
    "title": "My progress in the four language skills",
    "description": "This section contains examples of my work that demonstrate my growth in the four Spanish language skills, each supporting my vision board goals of communicating with my wife's Argentine family and enhancing my professional opportunities."
  },
  "skills": [
    {
      "name": "Listening Comprehension",
      "projects": [
        {
          "title": "MODULE 5 - Presentation: El último vagón",
          "image": "/assets/ultimo-vagon.png",
          "reflection": "The 'El último vagón' presentation challenged my listening comprehension skills significantly as our group analyzed this Mexican film. I initially struggled with the characters' rural Mexican Spanish accents and colloquial expressions like 'Órale,' 'No manches,' and 'Chido.' The varied speech patterns—from the teacher's formal instruction Spanish to the children's rapid, casual conversations—required developing different listening strategies. I found myself replaying scenes multiple times, using Spanish subtitles as training wheels before attempting to understand without them. The film's authentic dialogue provided exposure to mid-20th century Mexican Spanish, complete with regional idioms and command forms that we had studied in class. Collaborating with group members enhanced my comprehension as we discussed unclear dialogue and context-specific meanings. This assignment directly supports my vision board goal of understanding my wife's Argentine family by developing my ear for different Spanish accents and speech patterns. The film's themes of education access, economic inequality, and cultural traditions also deepened my cultural understanding—another vision board goal. Most importantly, I've gained confidence in my ability to follow extended Spanish conversations, moving beyond isolated classroom exercises to comprehending authentic, unscripted dialogue."
        }
      ]
    },
    {
      "name": "Reading Comprehension",
      "projects": [
        {
          "title": "M8 - Hispanic Literature 2: El almohadón de plumas",
          "image": "/assets/almohadon.png",
          "reflection": "The 'El almohadón de plumas' assignment challenged me to comprehend sophisticated literary Spanish while analyzing narrative elements and cultural context. Initially, I struggled with Quiroga's early 20th century vocabulary and the nuanced psychological horror elements. The assignment required close reading strategies I hadn't previously developed in Spanish—identifying themes, character motivations, and symbolism across linguistic barriers. Through multiple readings and contextual analysis, I gained confidence in approaching complex Spanish texts. This experience taught me specialized vocabulary related to literary analysis (like 'narrador omnisciente' and 'atmósfera') while improving my ability to understand indirect meaning and symbolism. The most valuable outcome was learning to interpret cultural elements embedded in Hispanic literature—understanding how Quiroga's Uruguayan background and the time period influenced his unique blend of naturalism and psychological horror. This skill directly supports my goal of deeper cultural understanding through authentic materials, moving beyond mechanical translation to genuine literary appreciation."
        }
      ]
    },
    {
      "name": "Speaking",
      "projects": [
        {
          "title": "M7 Assignment 3: Los Bomberos",
          "isVideo": true,
          "reflection": "The Los Bomberos speaking assignment required me to create a video presentation based on a short story about firefighters. This assignment challenged me to read and comprehend an authentic Spanish narrative, visualize the story, and then create my own spoken content around it. I initially struggled with the specialized vocabulary and the task of transforming written content into an engaging presentation. The preparation process taught me valuable strategies—visualizing the text as I read, selecting key scenes to highlight, and creating a narrative flow that worked in spoken form. After completing several takes, I noticed significant improvement in my pronunciation and storytelling ability. The creative freedom of this project allowed me to practice a variety of sentence structures and verb tenses as I described the scenes and created commentary. This project connected language learning to creative expression in a way textbook exercises cannot. The positive feedback I received boosted my confidence significantly. The video presentation (available at https://youtu.be/hbBn575CiVk) demonstrates my progress in speaking skills from earlier in the semester, showing improved fluency and confidence when speaking Spanish.",
          "link": "https://youtu.be/hbBn575CiVk"
        },
        {
          "title": "M3 - Assignment 2: La Casa de Frida",
          "isVideo": true,
          "reflection": "The La Casa de Frida video project pushed me to integrate cultural understanding with speaking skills, requiring me to research Frida Kahlo's home and describe its significance in Spanish. This was my first substantial video presentation in Spanish, and I initially struggled with pronunciation and fluency when recording myself speaking continuously. The preparation process taught me valuable strategies—writing a script, practicing repeatedly, and finally recording in small segments to maintain clarity. The transcript shows I was able to communicate facts about Juan O'Gorman's architectural design and how the house functioned for both Rivera and Kahlo. The instructor feedback highlighted areas where I need improvement, particularly with pronunciation of specific sounds like T, TR, and R, and my overall fluency was rated at a novice level with some choppiness. This honest assessment was valuable for my development. Despite these challenges, this project gave me confidence to attempt speaking assignments later in the course. The cultural research component enhanced my understanding of how personal spaces reflect cultural identity, connecting language learning directly to cultural appreciation. This experience taught me that focused practice with specific sounds is critical for my continued improvement in Spanish pronunciation.",
          "link": "https://youtu.be/a8oUzUjKYEs"
        }
      ]
    },
    {
      "name": "Writing",
      "projects": [
        {
          "title": "MODULE 9 - Final Project: Spanish ePortfolio",
          "image": "logo.svg",
          "reflection": "Creating this ePortfolio combined my professional identity as a software engineer with my Spanish language journey. As I built this site using React, I had to think in both programming languages and Spanish simultaneously, which created a unique meta-learning experience. Writing reflections in English while contemplating Spanish concepts helped me bridge cognitive frameworks between languages. The process of documenting my journey required me to synthesize grammar concepts, vocabulary, and cultural insights I'd gained throughout the semester, solidifying my understanding. Translating technical concepts from my programming background into clear explanations about my language learning process improved my communication skills in both domains. The most challenging aspect was organizing content to demonstrate growth across different language skills while maintaining a coherent narrative. This project directly fulfilled my vision board goal of blending my professional skills with Spanish, as I created a fully responsive web application with Spanish content that showcases both my technical abilities and language progress. The satisfaction of applying my software engineering expertise to language learning proved that cross-disciplinary approaches strengthen learning outcomes. Looking ahead, this portfolio serves as both documentation of my progress and a foundation for continued language development as I pursue my goal of using Spanish in professional settings.",
          "link": "https://github.com/ianskelskey/spanish-portfolio"
        }
      ]
    }
  ],
  "additionalProjects": [
    {
      "title": "Assignment 2: Vision Board",
      "type": "Culture & Goals",
      "image": "/assets/vision-board.png",
      "reflection": "Creating my Spanish Vision Board was a foundational exercise that helped me articulate why learning Spanish matters to me personally and professionally. I structured my board around five key motivations: Spanish's ubiquity in today's world, cognitive benefits of bilingualism, transferable discipline gained from language learning, professional advancement opportunities, and the genuine enjoyment of learning. The process of researching and organizing these motivations deepened my commitment to language acquisition. Most importantly, identifying specific personal goals—communicating with my wife's Argentine family, improving travel experiences, enhancing career prospects, deepening cultural understanding, and building confidence—gave me concrete targets to work toward throughout the semester. This assignment helped me recognize that my motivation for learning Spanish extends beyond classroom requirements to genuine life enrichment. Revisiting this vision board throughout the semester has provided motivation during challenging moments and helped me recognize my progress. The research I conducted on bilingualism's cognitive benefits was particularly enlightening, giving me additional motivation by understanding how language learning physically affects the brain. This project set the tone for my entire Spanish learning journey by encouraging me to approach language acquisition not as an academic exercise but as a meaningful life skill with far-reaching benefits."
    },
    {
      "title": "Assignment 3: Greetings (Discussion Post)",
      "type": "Speaking & Introduction",
      "image": "/assets/greeting.png",
      "reflection": "The Greetings discussion post was my first opportunity to introduce myself in Spanish. This seemingly simple assignment revealed the gap between knowing vocabulary and actually using it to communicate about myself. I found it challenging to express my identity with limited language tools—describing my profession as a software engineer, explaining my connection to Argentina through my wife, and sharing my interests required creative use of basic vocabulary. I initially wrote each sentence in English and translated it, but quickly realized this created unnatural structures. Instead, I focused on using simple patterns I was confident in ('Soy...', 'Me gusta...', 'Tengo...'), which helped me communicate authentically within my abilities. This assignment taught me that effective communication can happen even with limited vocabulary when focusing on clarity rather than complexity. Looking back, I see several grammar errors and awkward constructions in my introduction, but I'm proud that I successfully conveyed key information about myself. This assignment served as a baseline for measuring my progress throughout the course, and reviewing it now highlights how much more comfortable and natural my Spanish expression has become."
    }
  ]
}
