{
  "academicInfo": {
    "course": "Spanish 2011",
    "institution": "CT State: Three Rivers",
    "semester": "Spring 2025"
  },
  "quote": {
    "text": "El límite del idioma significa el límite de mi mundo.",
    "author": "Adaptado de Ludwig Wittgenstein"
  },
  "profile": {
    "image": "/assets/headshot.png",
    "introduction": [
      "Buenas noches. Soy Ian Skelskey. Soy Americano. Soy de Bristol, Connecticut, Estados Unidos. Ahora vivo en Southington. Soy ingeniero de software. Puedo tocar el piano y la guitarra. Mi esposa es de Argentina.",
      "Trabajo más de 40 horas por semana y tengo dos trabajos. Jugué al fútbol cuando era niño, pero ahora solo voy al gimnasio. Me gustan muchos tipos de música, pero mi favorita de España es el flamenco pop. Mi restaurante favorito es Thai Avenue en Bristol. Mi color favorito es el púrpura.",
      "Me gustan los videojuegos, escribir código, ver películas, comer y dormir. Tengo treinta y un años. Muchas gracias. Hasta mañana."
    ],
    "socialLinks": [
      {
        "platform": "GitHub",
        "url": "https://github.com/ianskelskey"
      },
      {
        "platform": "LinkedIn",
        "url": "https://www.linkedin.com/in/ianskelskey/"
      }
    ]
  },
  "spanishHistory": "Before this class, I had some experience with Spanish from previous coursework and personal interest. I was familiar with basic grammar and vocabulary but needed more practice with listening and speaking, especially with Argentine Spanish which is important for communicating with my wife's family.",
  "whyLearnSpanish": "Learning Spanish is important to me both personally and professionally. My primary motivation is to connect better with my wife's family in Argentina and understand their culture more deeply. Additionally, as outlined in my vision board, I recognize the cognitive benefits of bilingualism, the transferable discipline it develops, and the professional opportunities it can create in my career as a software engineer. Spanish opens doors to richer cultural experiences and a broader human dialogue in our interconnected world."
}